// #include "field_player_avatar.h"
// #include "field_map_object.h"
// #include "script.h"
#include "filesystem.h"
#include "heap.h"
#include "unk_0200E320.h"

typedef struct OBJECT_EVENT {
    u16 id;
    u16 ovid;
    u16 mvt;
    u16 type;
    u16 flag;
    u16 scr;
    s16 dirn;
    u16 eye;
    u16 unk10;
    u16 tsure_poke_color;
    s16 xrange;
    s16 yrange;
    u16 x;
    u16 y;
    s32 z;
} OBJECT_EVENT;

typedef struct FieldSystem FieldSystem;
typedef struct LocalMapObject LocalMapObject;

typedef struct MapObjectMan {
    u32 flags;
    u32 object_count;
    u32 unk8;
    u32 unkC;
    u8 unk10[4];
    NARC* mmodel_narc;
    u8 unk18[4];
    u8 unk1C[0x124-0x1C];
    LocalMapObject* objects;
    FieldSystem* fsys;
} MapObjectMan; // size: 0x12c

typedef void (LocalMapObject_UnkCallback)();

typedef struct LocalMapObject {
    /*0x000*/ u32 flags;
    /*0x004*/ u32 flags2;
    /*0x008*/ int id;
    /*0x00C*/ int unkC;
    /*0x010*/ int gfxId;
    /*0x014*/ int movement;
    /*0x018*/ int type;
    /*0x01C*/ int evFlagId;
    /*0x020*/ int scriptId;
    /*0x024*/ int facingInit;
    /*0x028*/ int curFacing;
    /*0x02C*/ int nextFacing;
    /*0x030*/ int curFacingBak;
    /*0x034*/ int nextFacingBak;
    /*0x038*/ int param[3];
    /*0x044*/ int xrange;
    /*0x048*/ int yrange;
    /*0x04C*/ int xInit;
    /*0x050*/ int hInit;
    /*0x054*/ int yInit;
    /*0x058*/ int xPrev;
    /*0x05C*/ int hPrev;
    /*0x060*/ int yPrev;
    /*0x064*/ int xCurr;
    /*0x068*/ int hCurr;
    /*0x06C*/ int yCurr;
    /*0x070*/ VecFx32 posVec;
    /*0x07C*/ VecFx32 faceVec;
    /*0x088*/ VecFx32 unk88;
    /*0x094*/ VecFx32 unk94;
    /*0x0A0*/ int unkA0;
    /*0x0A4*/ int movementCmd;
    /*0x0A8*/ int movementStep;
    /*0x0AC*/ u16 unkAC;
    /*0x0AE*/ u16 unkAE;
    /*0x0B0*/ int unkB0;
    /*0x0B4*/ MapObjectMan* manager;
    /*0x0B8*/ LocalMapObject_UnkCallback* unkB8;
    /*0x0BC*/ LocalMapObject_UnkCallback* unkBC;
    /*0x0C0*/ LocalMapObject_UnkCallback* unkC0;
    /*0x0C4*/ LocalMapObject_UnkCallback* unkC4;
    /*0x0C8*/ LocalMapObject_UnkCallback* unkC8;
    /*0x0CC*/ LocalMapObject_UnkCallback* unkCC;
    /*0x0D0*/ LocalMapObject_UnkCallback* unkD0;
    /*0x0D4*/ LocalMapObject_UnkCallback* unkD4;
    /*0x0D8*/ u8 unkD8[0x10];
    /*0x0E8*/ u8 unkE8[0x10];
    /*0x0F8*/ u8 unkF8[0x10];
    /*0x108*/ u8 unk108[0x20];
    /*0x128*/ u16 unk128;
} LocalMapObject;

typedef struct Unkthing {
    u32 unk0;
    LocalMapObject_UnkCallback* unk4;
    LocalMapObject_UnkCallback* unk8;
    LocalMapObject_UnkCallback* unkC;
    LocalMapObject_UnkCallback* unk10;
} Unkthing;

typedef struct Unkthing2 {
    LocalMapObject_UnkCallback* unk0;
    LocalMapObject_UnkCallback* unk4;
    LocalMapObject_UnkCallback* unk8;
    LocalMapObject_UnkCallback* unkC;
    LocalMapObject_UnkCallback* unk10;
} Unkthing2;

typedef struct SavedMapObject SavedMapObject;

MapObjectMan* MapObjectMan_new(u32 count);
void MapObjectMan_SetFieldSysPtr(MapObjectMan*, FieldSystem*);
void MapObjectMan_SetCount(MapObjectMan*, u32);
void sub_0205F198(MapObjectMan*, u32);
LocalMapObject* MapObjectMan_GetArray(MapObjectMan*);
void MapObject_Remove(LocalMapObject* object);
void sub_0205E420(LocalMapObject* object);
u32 MapObject_GetBitsWord(LocalMapObject* object);
void MapObject_SetXRange(LocalMapObject* object, u32 x_range);
