#include "oaks_speech.h"

#include "global.h"

#include "msgdata/msg.naix"
#include "msgdata/msg/msg_0219.h"

#include "font.h"
#include "gf_gfx_loader.h"
#include "launch_application.h"
#include "main.h"
#include "math_util.h"
#include "overlay_36.h"
#include "overlay_manager.h"
#include "player_data.h"
#include "render_text.h"
#include "unk_02005D10.h"
#include "unk_0200FA24.h"
#include "unk_020163E0.h"
#include "unk_02082908.h"

FS_EXTERN_OVERLAY(OVY_36);

typedef struct OaksSpeechData_Sub178 {
} OaksSpeechData_Sub178;

typedef struct OakSpeechData_Sub160 {
    u8 unk_0;
    u8 unk_1;
    u8 unk_2;
    u8 unk_3;
    u8 unk_4;
    u8 unk_5;
    u8 unk_6;
    u8 unk_7;
} OakSpeechData_Sub160;

typedef struct OaksSpeechData {
    HeapID heapId;      // 0x000
    SaveData *saveData; // 0x004
    Options *options;   // 0x008
    int unk_00C;
    int unk_010;
    OVY_MANAGER *unk_014;
    BgConfig *bgConfig; // 0x018
    Window window_0;
    Window window_1;
    Window windows_2thru6[4];
    int unk_07C;
    int unk_080;
    u8 filler_084[0x50];
    SpriteGfxHandler *unk_0D4;
    int unk_0D8;
    u8 filler_0DC[0xC];
    int unk_0E8;
    u8 filler_0EC[0x14];
    MsgData *msgData;
    int unk_104;
    int unk_108;
    u32 textPrinter;
    String *string; // 0x110
    UnkStruct_020163E0 *unk_114;
    MessageFormat *msgFormat;
    u8 filler_11C[0x4];
    NamingScreenArgs *namingScreenArgs_Player; // 0x120
    NamingScreenArgs *namingScreenArgs_Rival;  // 0x124
    int unk_128;
    int unk_12C;
    int unk_130;
    u16 playerGender; // 0x134
    u16 unk_136;
    u8 filler_138[0x4];
    int unk_13C;
    int unk_140;
    int unk_144;
    u8 filler_148[0x18];
    OakSpeechData_Sub160 unk_160;
    int unk_168;
    int unk_16C;
    u8 filler_170[0x8];
    OaksSpeechData_Sub178 *unk_178;
    int unk_17C;
} OaksSpeechData; // size: 0x180

void ov53_021E5BCC(void *cbArg);
void ov53_021E5BDC(OaksSpeechData *data);
void ov53_021E5DE0(OaksSpeechData *data);
void ov53_021E5E6C(OaksSpeechData *data);
void ov53_021E5EB8(OaksSpeechData *data);
BOOL ov53_021E5EDC(OaksSpeechData *data, int param, BOOL isFadeOut);
BOOL ov53_021E60CC(OaksSpeechData *data, int a1);
void ov53_021E60E8(OaksSpeechData *data, int bgId, int palette);
BOOL ov53_021E611C(OaksSpeechData *data, int msgNum, int waitButtonMode);
BOOL ov53_021E628C(OaksSpeechData *data, int msgNum, int a2, int a3, int a4);
BOOL ov53_021E64B4(OaksSpeechData *data, int msgNum, int a2);
